УправлениеПаркомАттракционов/src/Catalogs/ЭмитентыJWT/ЭмитентыJWT.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭмитентыJWT</name>
  <predefined>
    <items>
      <name>ЭмитентМобильногоПриложения</name>
      <description>Эмитент мобильного приложения</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяЭмитента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>ИмяПолучателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УправлениеПаркомАттракционов/src/CommonModules/ТокеныДоступа/Module.bsl
#Область ПрограммныйИнтерфейс

// Формирует токен доступа с заданными параметрами
//
// Параметры:
//  ПараметрыФормирования - Структура - параметры для формирования токена:
//   * Эмитент     - Строка - эмитент токена
//   * Получатели  - Массив из Строка  - массив получателей токена
//   * КлючПодписи - Строка - ключ для подписи токена
//   * ВремяЖизни  - Число  - время жизни токена (в секундах)
//  ИмяПользователя - Строка - необязательный, имя пользователя для токена
//
// Возвращаемое значение:
//  Строка - сформированный токен доступа
//
Функция СформироватьТокенДоступа(Знач ПараметрыФормирования, Знач ИмяПользователя = Неопределено) Экспорт
	
	Если ТипЗнч(ПараметрыФормирования) = Тип("СправочникСсылка.ЭмитентыJWT") Тогда
		ПараметрыФормирования = ПараметрыФормированияТокенаИзСправочника(ПараметрыФормирования);
	КонецЕсли;
	
	Если ИмяПользователя = Неопределено Тогда
		ИмяПользователя = ИмяПользователя();
	КонецЕсли;
	
	ТокенДоступа = Новый ТокенДоступа();
	ТокенДоступа.Эмитент = ПараметрыФормирования.Эмитент;
	
	Для Каждого Строка Из ПараметрыФормирования.Получатели Цикл
		ТокенДоступа.Получатели.Добавить(Строка);
	КонецЦикла;
	
	ТокенДоступа.КлючСопоставленияПользователя = ИмяПользователя;
	
	ТокенДоступа.ВремяСоздания = ТекущаяУниверсальнаяДата() - '19700101';
	ТокенДоступа.ВремяЖизни = ПараметрыФормирования.ВремяЖизни;
	ТокенДоступа.Подписать(АлгоритмПодписиТокенаДоступа.HS256, ПараметрыФормирования.КлючПодписи);
	
	Возврат Строка(ТокенДоступа);
	
КонецФункции

// Возвращает сохраненный ключ подписи из безопасного хранилища для указанного эмитента JWT.
//
// Параметры:
//  Ссылка - СправочникСсылка.ЭмитентыJWT - ссылка на элемент справочника ЭмитентыJWT
//
// Возвращаемое значение:
//  Строка - сохраненный ключ подписи из безопасного хранилища
//
Функция СохраненныйКлючПодписи(Ссылка) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Ссылка, "КлючПодписи");
КонецФункции

// Функция-конструктор параметров для формирования токена доступа.
//
// Возвращаемое значение:
//   Структура:
//     * Эмитент - Строка - эмитент токена (значение по умолчанию: пустая строка)
//     * Получатели - Массив из Строка - получатели токена (значение по умолчанию: новый массив)
//     * КлючПодписи - Строка - ключ подписи токена (значение по умолчанию: пустая строка)
//     * ВремяЖизни - Число - время жизни токена в секундах (значение по умолчанию: 86400 - сутки)
//
Функция НовыеПараметрыФормированияТокена() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Эмитент", "");
	Результат.Вставить("Получатели", Новый Массив);
	Результат.Вставить("КлючПодписи", "");
	Результат.Вставить("ВремяЖизни", 86400); // Сутки
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыФормированияТокенаИзСправочника(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭмитентыJWT.ИмяЭмитента КАК ИмяЭмитента,
		|	ЭмитентыJWT.Получатели.(
		|		ИмяПолучателя КАК ИмяПолучателя) КАК Получатели
		|ИЗ
		|	Справочник.ЭмитентыJWT КАК ЭмитентыJWT
		|ГДЕ
		|	ЭмитентыJWT.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Результат = НовыеПараметрыФормированияТокена();
	Результат.Эмитент = Выборка.ИмяЭмитента;
	
	ВыборкаПолучатели = Выборка.Получатели.Выбрать();
	
	Пока ВыборкаПолучатели.Следующий() Цикл
		Результат.Получатели.Добавить(ВыборкаПолучатели.ИмяПолучателя);
	КонецЦикла;
	
	Результат.КлючПодписи = СохраненныйКлючПодписи(Ссылка);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
